"""#2"""

import re


def find_phone_numbers(text: str) -> list[str]:
    """
    Виділяє всі телефонні номери з переданого тексту.

    Args:
        text (str): Вхідний текст, з якого потрібно витягнути телефонні номери.

    Returns:
        list[str]: Список знайдених телефонних номерів.
    """
    pattern = re.compile(r'\(?\d{3}\)?[ .-]?\d{3}[ .-]?\d{4}')
    return pattern.findall(text)


if __name__ == "__main__":
    TEXT ="""
        Контактна інформація:
        - Мій номер телефону: (123) 456-7890
        - Ось ще один номер: 123-456-7890
        - Якщо не зможете до мене додзвонитись, спробуйте 123.456.7890
        - Відправте повідомлення на 1234567890, якщо терміново.
    """
    print(find_phone_numbers(TEXT))
